reports/p14-1/duplicate/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /workspace/scripts/duplicate_order.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * duplicates: 1000 iterations shared among 100 VUs (maxDuration: 2m0s, gracefulStop: 30s)


     ✓ accepted or business rejected

     business_accepted..............: 200     1017.339494/s
     business_duration..............: avg=18.13ms  min=1.25ms med=13.74ms max=71.51ms p(90)=43.84ms  p(95)=51.7ms   p(99)=60.59ms
     business_out_of_stock..........: 800     4069.357975/s
     business_rejected..............: 800     4069.357975/s
     checks.........................: 100.00% 1000 out of 1000
     data_received..................: 168 kB  854 kB/s
     data_sent......................: 158 kB  804 kB/s
     http_req_blocked...............: avg=866.52µs min=416ns  med=1.16µs  max=23.59ms p(90)=155.08µs p(95)=3.21ms   p(99)=19.35ms
     http_req_connecting............: avg=180.57µs min=0s     med=0s      max=17.19ms p(90)=3.98µs   p(95)=778.02µs p(99)=2.28ms 
   ✓ http_req_duration..............: avg=18.13ms  min=1.25ms med=13.74ms max=71.51ms p(90)=43.84ms  p(95)=51.7ms   p(99)=60.59ms
       { expected_response:true }...: avg=18.13ms  min=1.25ms med=13.74ms max=71.51ms p(90)=43.84ms  p(95)=51.7ms   p(99)=60.59ms
   ✓ http_req_failed................: 0.00%   0 out of 1000
     http_req_receiving.............: avg=132.35µs min=4.66µs med=24.14µs max=8.25ms  p(90)=185.04µs p(95)=475.8µs  p(99)=1.98ms 
     http_req_sending...............: avg=442.81µs min=1.37µs med=4.04µs  max=16.62ms p(90)=192.62µs p(95)=2.56ms   p(99)=13.84ms
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s      max=0s      p(90)=0s       p(95)=0s       p(99)=0s     
     http_req_waiting...............: avg=17.55ms  min=1.23ms med=13.63ms max=67.29ms p(90)=42.2ms   p(95)=47.09ms  p(99)=53.82ms
     http_reqs......................: 1000    5086.697468/s
     iteration_duration.............: avg=19.16ms  min=1.29ms med=13.89ms max=90.83ms p(90)=46.05ms  p(95)=60.61ms  p(99)=74.55ms
     iterations.....................: 1000    5086.697468/s
   ✓ technical_errors...............: 0.00%   0 out of 1000


running (0m00.2s), 000/100 VUs, 1000 complete and 0 interrupted iterations
duplicates ✓ [ 100% ] 100 VUs  0m00.2s/2m0s  1000/1000 shared iters